---
kind: other
id: Methods.T:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
source: html/b828d560-ca3c-14f4-ab19-ef2c5409b212.htm
---
# KeyBasedTreeEntriesLoadContent Methods

Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.